#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/koisland/aws_terraform_smk_pipeline/runs/run-KTugz9fBmu624n7G

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
module.snakemake.module.lambda_function.data.external.archive_prepare[0]: Refreshing...
module.snakemake.module.lambda_function.data.external.archive_prepare[0]: Refresh complete after 1s [id=-]
module.snakemake.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=bbc9846e063c1a3dc75343a7c1fd3b789be45276]
module.snakemake.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=5446599911847381392]
module.snakemake.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=122832108672496102]
module.snakemake.data.aws_subnets.default: Refreshing...
module.snakemake.module.s3_smk_input.data.aws_caller_identity.current: Refreshing...
module.snakemake.module.s3_smk_output.data.aws_caller_identity.current: Refreshing...
module.snakemake.module.s3_smk_output.data.aws_canonical_user_id.this: Refreshing...
module.snakemake.module.s3_smk_input.data.aws_canonical_user_id.this: Refreshing...
module.snakemake.data.aws_vpc.default: Refreshing...
module.snakemake.module.lambda_function.data.aws_caller_identity.current: Refreshing...
module.snakemake.module.s3_smk_input.data.aws_region.current: Refreshing...
module.snakemake.aws_iam_role.ecs_job_role: Refreshing state... [id=snakemake_ecs_job_role]
module.snakemake.module.s3_notification.data.aws_partition.this: Refreshing...
module.snakemake.module.s3_notification.data.aws_partition.this: Refresh complete after 0s [id=aws]
module.snakemake.module.s3_smk_input.data.aws_region.current: Refresh complete after 0s [id=us-west-1]
module.snakemake.module.lambda_function.data.aws_region.current: Refreshing...
module.snakemake.module.lambda_function.data.aws_region.current: Refresh complete after 0s [id=us-west-1]
module.snakemake.module.s3_smk_input.aws_s3_bucket.this[0]: Refreshing state... [id=snakemake-input]
module.snakemake.aws_iam_role.batch_role: Refreshing state... [id=snakemake_batch_role]
module.snakemake.module.s3_smk_input.data.aws_caller_identity.current: Refresh complete after 0s [id=985118252342]
module.snakemake.module.s3_smk_output.data.aws_caller_identity.current: Refresh complete after 0s [id=985118252342]
module.snakemake.module.lambda_function.data.aws_caller_identity.current: Refresh complete after 0s [id=985118252342]
module.snakemake.aws_iam_role.ec2_role: Refreshing state... [id=snakemake_ec2_role]
module.snakemake.module.lambda_function.data.aws_partition.current: Refreshing...
module.snakemake.module.lambda_function.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.snakemake.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/snakemake-lambda]
module.snakemake.module.s3_smk_output.aws_s3_bucket.this[0]: Refreshing state... [id=snakemake-output]
module.snakemake.module.s3_smk_output.data.aws_region.current: Refreshing...
module.snakemake.module.s3_smk_output.data.aws_region.current: Refresh complete after 0s [id=us-west-1]
module.snakemake.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refreshing...
module.snakemake.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=3693445097]
module.snakemake.aws_batch_job_definition.standard: Refreshing state... [id=arn:aws:batch:us-west-1:985118252342:job-definition/snakemake_standard:2]
module.snakemake.aws_iam_role_policy_attachment.ec2_policy_attachment: Refreshing state... [id=snakemake_ec2_role-20230401225534221400000002]
module.snakemake.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=snakemake-lambda]
module.snakemake.aws_iam_instance_profile.ec2_profile: Refreshing state... [id=snakemake_ec2_profile]
module.snakemake.aws_iam_role_policy_attachment.batch_policy_attachment: Refreshing state... [id=snakemake_batch_role-20230401230713778100000001]
module.snakemake.module.s3_smk_input.data.aws_canonical_user_id.this: Refresh complete after 0s [id=c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2]
module.snakemake.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::985118252342:policy/snakemake-lambda-logs]
module.snakemake.module.s3_smk_output.data.aws_canonical_user_id.this: Refresh complete after 0s [id=c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2]
module.snakemake.data.aws_subnets.default: Refresh complete after 0s [id=us-west-1]
module.snakemake.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=snakemake-lambda-20230401225534823500000003]
module.snakemake.data.aws_vpc.default: Refresh complete after 1s [id=vpc-96b76df0]
module.snakemake.aws_security_group.batch_standard: Refreshing state... [id=sg-06e55f841aab62a9c]
module.snakemake.aws_batch_compute_environment.standard: Refreshing state... [id=snakemake_standard]
module.snakemake.aws_batch_job_queue.main_queue: Refreshing state... [id=arn:aws:batch:us-west-1:985118252342:job-queue/snakemake_main_queue]
module.snakemake.module.s3_smk_input.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=snakemake-input]
module.snakemake.module.s3_smk_input.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=snakemake-input]
module.snakemake.module.s3_smk_input.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=snakemake-input]
module.snakemake.module.lambda_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::985118252342:policy/snakemake-lambda]
module.snakemake.aws_iam_policy.read_write_s3: Refreshing state... [id=arn:aws:iam::985118252342:policy/snakemake_read_write_s3]
module.snakemake.module.s3_smk_output.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=snakemake-output]
module.snakemake.module.s3_smk_output.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=snakemake-output]
module.snakemake.module.s3_smk_output.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=snakemake-output]
module.snakemake.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=snakemake-lambda-20230402085843071000000001]
module.snakemake.aws_iam_role_policy_attachment.s3_access_policy_attachment: Refreshing state... [id=snakemake_ecs_job_role-20230401225536437700000004]
module.snakemake.module.s3_smk_input.aws_s3_bucket_acl.this[0]: Refreshing state... [id=snakemake-input,private]
module.snakemake.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=snakemake-lambda]
module.snakemake.module.s3_smk_output.aws_s3_bucket_acl.this[0]: Refreshing state... [id=snakemake-output,private]
module.snakemake.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromS3Bucket"]: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.snakemake.module.lambda_function.aws_lambda_permission.current_version_triggers["AllowExecutionFromS3Bucket"]: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.snakemake.module.s3_notification.aws_lambda_permission.allow["lambda1"]: Refreshing state... [id=AllowLambdaS3BucketNotification-20230402083720525700000001]
module.snakemake.module.s3_notification.aws_s3_bucket_notification.this[0]: Refreshing state... [id=snakemake-input]
module.snakemake.aws_batch_compute_environment.standard: Drift detected (update)
module.snakemake.module.lambda_function.local_file.archive_plan[0]: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.snakemake.aws_batch_compute_environment.standard must be replaced
-/+ resource "aws_batch_compute_environment" "standard" {
      ~ arn                             = "arn:aws:batch:us-west-1:985118252342:compute-environment/snakemake_standard" -> (known after apply)
      ~ compute_environment_name        = "snakemake_standard" -> "snakemake-standard-standard" # forces replacement
      + compute_environment_name_prefix = (known after apply)
      ~ ecs_cluster_arn                 = "arn:aws:ecs:us-west-1:985118252342:cluster/snakemake_standard_Batch_2e317c20-32c4-33a2-b59e-0b15b2f892fb" -> (known after apply)
      ~ id                              = "snakemake_standard" -> (known after apply)
      ~ service_role                    = "arn:aws:iam::985118252342:role/snakemake_batch_role" -> (known after apply)
      ~ status                          = "VALID" -> (known after apply)
      ~ status_reason                   = "ComputeEnvironment Healthy" -> (known after apply)
        tags                            = {
            "created-by" = "terraform"
        }
        # (3 unchanged attributes hidden)

      ~ compute_resources {
          - bid_percentage     = 0 -> null
          ~ desired_vcpus      = 0 -> (known after apply)
          ~ instance_role      = "arn:aws:iam::985118252342:instance-profile/snakemake_ec2_profile" # forces replacement -> (known after apply)
          ~ security_group_ids = [ # forces replacement
              - "sg-06e55f841aab62a9c",
            ] -> (known after apply)
          - tags               = {} -> null
            # (5 unchanged attributes hidden)

          - ec2_configuration {
              - image_type = "ECS_AL2" -> null
            }
        }
    }

  # module.snakemake.aws_batch_job_definition.standard must be replaced
-/+ resource "aws_batch_job_definition" "standard" {
      ~ arn                   = "arn:aws:batch:us-west-1:985118252342:job-definition/snakemake_standard:2" -> (known after apply)
      ~ container_properties  = jsonencode(
            {
              - command              = []
              - environment          = []
              - image                = "snakemake/snakemake:latest"
              - jobRoleArn           = "arn:aws:iam::985118252342:role/snakemake_ecs_job_role"
              - memory               = 1024
              - mountPoints          = []
              - resourceRequirements = []
              - secrets              = []
              - ulimits              = []
              - vcpus                = 2
              - volumes              = []
            } # forces replacement
        ) -> (known after apply)
      ~ id                    = "arn:aws:batch:us-west-1:985118252342:job-definition/snakemake_standard:2" -> (known after apply)
      ~ name                  = "snakemake_standard" -> "snakemake-standard-standard" # forces replacement
      ~ parameters            = { # forces replacement
          + "config" = ""
        }
      - platform_capabilities = [] -> null
      ~ revision              = 2 -> (known after apply)
        tags                  = {
            "created-by" = "terraform"
        }
        # (3 unchanged attributes hidden)
    }

  # module.snakemake.aws_batch_job_queue.main_queue must be replaced
-/+ resource "aws_batch_job_queue" "main_queue" {
      ~ arn                  = "arn:aws:batch:us-west-1:985118252342:job-queue/snakemake_main_queue" -> (known after apply)
      ~ compute_environments = [
          - "arn:aws:batch:us-west-1:985118252342:compute-environment/snakemake_standard",
        ] -> (known after apply)
      ~ id                   = "arn:aws:batch:us-west-1:985118252342:job-queue/snakemake_main_queue" -> (known after apply)
      ~ name                 = "snakemake_main_queue" -> "snakemake-standard-main-queue" # forces replacement
        tags                 = {
            "created-by" = "terraform"
        }
        # (3 unchanged attributes hidden)
    }

  # module.snakemake.aws_iam_instance_profile.ec2_profile must be replaced
-/+ resource "aws_iam_instance_profile" "ec2_profile" {
      ~ arn         = "arn:aws:iam::985118252342:instance-profile/snakemake_ec2_profile" -> (known after apply)
      ~ create_date = "2023-04-01T09:32:50Z" -> (known after apply)
      ~ id          = "snakemake_ec2_profile" -> (known after apply)
      ~ name        = "snakemake_ec2_profile" -> "snakemake-standard-ec2-profile" # forces replacement
      + name_prefix = (known after apply)
      ~ role        = "snakemake_ec2_role" -> "snakemake-standard-ec2-role"
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
      ~ unique_id   = "AIPA6KXM7TU3L3HXZWZB2" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.snakemake.aws_iam_policy.read_write_s3 must be replaced
-/+ resource "aws_iam_policy" "read_write_s3" {
      ~ arn         = "arn:aws:iam::985118252342:policy/snakemake_read_write_s3" -> (known after apply)
      ~ id          = "arn:aws:iam::985118252342:policy/snakemake_read_write_s3" -> (known after apply)
      ~ name        = "snakemake_read_write_s3" -> "snakemake-standard-read-write-s3" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::snakemake-input/*",
                          - "arn:aws:s3:::snakemake-output/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPA6KXM7TU3LOUTB2OYF" -> (known after apply)
        tags        = {
            "created-by" = "terraform"
        }
        # (2 unchanged attributes hidden)
    }

  # module.snakemake.aws_iam_role.batch_role must be replaced
-/+ resource "aws_iam_role" "batch_role" {
      ~ arn                   = "arn:aws:iam::985118252342:role/snakemake_batch_role" -> (known after apply)
      ~ create_date           = "2023-04-01T23:07:13Z" -> (known after apply)
      ~ id                    = "snakemake_batch_role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole",
        ] -> (known after apply)
      ~ name                  = "snakemake_batch_role" -> "snakemake-standard-batch-role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "created-by" = "terraform"
        }
      ~ unique_id             = "AROA6KXM7TU3EHPKF37RF" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.snakemake.aws_iam_role.ec2_role must be replaced
-/+ resource "aws_iam_role" "ec2_role" {
      ~ arn                   = "arn:aws:iam::985118252342:role/snakemake_ec2_role" -> (known after apply)
      ~ create_date           = "2023-04-01T09:32:50Z" -> (known after apply)
      ~ id                    = "snakemake_ec2_role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
        ] -> (known after apply)
      ~ name                  = "snakemake_ec2_role" -> "snakemake-standard-ec2-role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "created-by" = "terraform"
        }
      ~ unique_id             = "AROA6KXM7TU3APE65FSUS" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.snakemake.aws_iam_role.ecs_job_role must be replaced
-/+ resource "aws_iam_role" "ecs_job_role" {
      ~ arn                   = "arn:aws:iam::985118252342:role/snakemake_ecs_job_role" -> (known after apply)
      ~ create_date           = "2023-04-01T22:55:34Z" -> (known after apply)
      ~ id                    = "snakemake_ecs_job_role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::985118252342:policy/snakemake_read_write_s3",
        ] -> (known after apply)
      ~ name                  = "snakemake_ecs_job_role" -> "snakemake-standard-ecs-job-role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "created-by" = "terraform"
        }
      ~ unique_id             = "AROA6KXM7TU3EGXI4G23N" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.snakemake.aws_iam_role_policy_attachment.batch_policy_attachment must be replaced
-/+ resource "aws_iam_role_policy_attachment" "batch_policy_attachment" {
      ~ id         = "snakemake_batch_role-20230401230713778100000001" -> (known after apply)
      ~ role       = "snakemake_batch_role" -> "snakemake-standard-batch-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.snakemake.aws_iam_role_policy_attachment.ec2_policy_attachment must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ec2_policy_attachment" {
      ~ id         = "snakemake_ec2_role-20230401225534221400000002" -> (known after apply)
      ~ role       = "snakemake_ec2_role" -> "snakemake-standard-ec2-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.snakemake.aws_iam_role_policy_attachment.s3_access_policy_attachment must be replaced
-/+ resource "aws_iam_role_policy_attachment" "s3_access_policy_attachment" {
      ~ id         = "snakemake_ecs_job_role-20230401225536437700000004" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::985118252342:policy/snakemake_read_write_s3" # forces replacement -> (known after apply)
      ~ role       = "snakemake_ecs_job_role" -> "snakemake-standard-ecs-job-role" # forces replacement
    }

  # module.snakemake.aws_security_group.batch_standard must be replaced
-/+ resource "aws_security_group" "batch_standard" {
      ~ arn                    = "arn:aws:ec2:us-west-1:985118252342:security-group/sg-06e55f841aab62a9c" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-06e55f841aab62a9c" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "snakemake_batch_standard" -> "snakemake-standard-batch-standard" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "985118252342" -> (known after apply)
        tags                   = {
            "created-by" = "terraform"
        }
        # (4 unchanged attributes hidden)
    }

  # module.snakemake.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.snakemake.module.lambda_function.aws_cloudwatch_log_group.lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda" {
      ~ arn               = "arn:aws:logs:us-west-1:985118252342:log-group:/aws/lambda/snakemake-lambda" -> (known after apply)
      ~ id                = "/aws/lambda/snakemake-lambda" -> (known after apply)
      ~ name              = "/aws/lambda/snakemake-lambda" -> "/aws/lambda/snakemake-standard-lambda" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "created-by" = "terraform"
        }
        # (3 unchanged attributes hidden)
    }

  # module.snakemake.module.lambda_function.aws_iam_policy.additional_json[0] must be replaced
-/+ resource "aws_iam_policy" "additional_json" {
      ~ arn         = "arn:aws:iam::985118252342:policy/snakemake-lambda" -> (known after apply)
      ~ id          = "arn:aws:iam::985118252342:policy/snakemake-lambda" -> (known after apply)
      ~ name        = "snakemake-lambda" -> "snakemake-standard-lambda" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::snakemake-input/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "batch:SubmitJob",
                          - "batch:DescribeJobs",
                          - "batch:TerminateJob",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPA6KXM7TU3IBIZV5FUD" -> (known after apply)
        tags        = {
            "created-by" = "terraform"
        }
        # (2 unchanged attributes hidden)
    }

  # module.snakemake.module.lambda_function.aws_iam_policy.logs[0] must be replaced
-/+ resource "aws_iam_policy" "logs" {
      ~ arn         = "arn:aws:iam::985118252342:policy/snakemake-lambda-logs" -> (known after apply)
      ~ id          = "arn:aws:iam::985118252342:policy/snakemake-lambda-logs" -> (known after apply)
      ~ name        = "snakemake-lambda-logs" -> "snakemake-standard-lambda-logs" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-1:985118252342:log-group:/aws/lambda/snakemake-lambda:*:*",
                          - "arn:aws:logs:us-west-1:985118252342:log-group:/aws/lambda/snakemake-lambda:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPA6KXM7TU3E276DUPHG" -> (known after apply)
        tags        = {
            "created-by" = "terraform"
        }
        # (2 unchanged attributes hidden)
    }

  # module.snakemake.module.lambda_function.aws_iam_role.lambda[0] must be replaced
-/+ resource "aws_iam_role" "lambda" {
      ~ arn                   = "arn:aws:iam::985118252342:role/snakemake-lambda" -> (known after apply)
      ~ create_date           = "2023-04-01T22:55:34Z" -> (known after apply)
      ~ id                    = "snakemake-lambda" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::985118252342:policy/snakemake-lambda",
          - "arn:aws:iam::985118252342:policy/snakemake-lambda-logs",
        ] -> (known after apply)
      ~ name                  = "snakemake-lambda" -> "snakemake-standard-lambda" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "created-by" = "terraform"
        }
      ~ unique_id             = "AROA6KXM7TU3HP4FDF5D2" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.snakemake.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "additional_json" {
      ~ id         = "snakemake-lambda-20230402085843071000000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::985118252342:policy/snakemake-lambda" # forces replacement -> (known after apply)
      ~ role       = "snakemake-lambda" -> "snakemake-standard-lambda" # forces replacement
    }

  # module.snakemake.module.lambda_function.aws_iam_role_policy_attachment.logs[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "logs" {
      ~ id         = "snakemake-lambda-20230401225534823500000003" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::985118252342:policy/snakemake-lambda-logs" # forces replacement -> (known after apply)
      ~ role       = "snakemake-lambda" -> "snakemake-standard-lambda" # forces replacement
    }

  # module.snakemake.module.lambda_function.aws_lambda_function.this[0] must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-west-1:985118252342:function:snakemake-lambda" -> (known after apply)
      ~ filename                       = "builds/240971e023b66d4d893c07077fa45e9610b7f3c1b22f1e2f9be003bea78bb99e.zip" -> "builds/6c398cbb3894aca15a5914ddd3d21a2cfa11afec37bf86cfa242c89841fe7670.zip"
      ~ function_name                  = "snakemake-lambda" -> "snakemake-standard-lambda" # forces replacement
      ~ id                             = "snakemake-lambda" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:985118252342:function:snakemake-lambda/invocations" -> (known after apply)
      ~ last_modified                  = "2023-04-02T09:34:50.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-1:985118252342:function:snakemake-lambda:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:985118252342:function:snakemake-lambda:3/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::985118252342:role/snakemake-lambda" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "liCC395WR07EkNCe84ei4rFwMkP8FOu41sITDWuzbPQ=" -> (known after apply)
      ~ source_code_size               = 863 -> (known after apply)
        tags                           = {
            "created-by" = "terraform"
        }
      ~ version                        = "3" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "job_def"   = "snakemake_standard" -> "snakemake-standard_standard"
              ~ "job_queue" = "snakemake_main_queue" -> "snakemake-standard_main_queue"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.snakemake.module.lambda_function.aws_lambda_permission.current_version_triggers["AllowExecutionFromS3Bucket"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ function_name       = "snakemake-lambda" -> "snakemake-standard-lambda" # forces replacement
      ~ id                  = "AllowExecutionFromS3Bucket" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::snakemake-input" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.snakemake.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromS3Bucket"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
      ~ function_name       = "snakemake-lambda" -> "snakemake-standard-lambda" # forces replacement
      ~ id                  = "AllowExecutionFromS3Bucket" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::snakemake-input" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.snakemake.module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.8",
                      + "modules/snakemake/lambda_py/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "modules/snakemake/lambda_py",
                      + null,
                    ],
                ]
              + filename      = "builds/6c398cbb3894aca15a5914ddd3d21a2cfa11afec37bf86cfa242c89841fe7670.zip"
              + runtime       = "python3.8"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6c398cbb3894aca15a5914ddd3d21a2cfa11afec37bf86cfa242c89841fe7670.plan.json"
      + id                   = (known after apply)
    }

  # module.snakemake.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5446599911847381392" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/240971e023b66d4d893c07077fa45e9610b7f3c1b22f1e2f9be003bea78bb99e.zip" -> "builds/6c398cbb3894aca15a5914ddd3d21a2cfa11afec37bf86cfa242c89841fe7670.zip"
          ~ "timestamp" = "1680428053166554000" -> "1680480191589745000"
        }
    }

  # module.snakemake.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "122832108672496102" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/240971e023b66d4d893c07077fa45e9610b7f3c1b22f1e2f9be003bea78bb99e.zip" -> "builds/6c398cbb3894aca15a5914ddd3d21a2cfa11afec37bf86cfa242c89841fe7670.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.snakemake.module.s3_notification.aws_lambda_permission.allow["lambda1"] must be replaced
-/+ resource "aws_lambda_permission" "allow" {
      ~ function_name       = "snakemake-lambda" -> "snakemake-standard-lambda" # forces replacement
      ~ id                  = "AllowLambdaS3BucketNotification-20230402083720525700000001" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::snakemake-input" # forces replacement -> (known after apply)
      ~ statement_id        = "AllowLambdaS3BucketNotification-20230402083720525700000001" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.snakemake.module.s3_notification.aws_s3_bucket_notification.this[0] must be replaced
-/+ resource "aws_s3_bucket_notification" "this" {
      ~ bucket      = "snakemake-input" # forces replacement -> (known after apply)
      ~ id          = "snakemake-input" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ lambda_function {
            id                  = "lambda1"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-1:985118252342:function:snakemake-lambda" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket.this[0] must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::snakemake-input" -> (known after apply)
      ~ bucket                      = "snakemake-input" -> "snakemake-standard-input" # forces replacement
      ~ bucket_domain_name          = "snakemake-input.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "snakemake-input.s3.us-west-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2F56UZL2M1ACD" -> (known after apply)
      ~ id                          = "snakemake-input" -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket_acl.this[0] must be replaced
-/+ resource "aws_s3_bucket_acl" "this" {
      ~ bucket = "snakemake-input" # forces replacement -> (known after apply)
      ~ id     = "snakemake-input,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "koshima789" -> null
                  - id           = "c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          - owner {
              - display_name = "koshima789" -> null
              - id           = "c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2" -> null
            }
        }
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "snakemake-input" # forces replacement -> (known after apply)
      ~ id                      = "snakemake-input" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket = "snakemake-input" # forces replacement -> (known after apply)
      ~ id     = "snakemake-input" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket = "snakemake-input" # forces replacement -> (known after apply)
      ~ id     = "snakemake-input" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket.this[0] must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::snakemake-output" -> (known after apply)
      ~ bucket                      = "snakemake-output" -> "snakemake-standard-output" # forces replacement
      ~ bucket_domain_name          = "snakemake-output.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "snakemake-output.s3.us-west-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2F56UZL2M1ACD" -> (known after apply)
      ~ id                          = "snakemake-output" -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket_acl.this[0] must be replaced
-/+ resource "aws_s3_bucket_acl" "this" {
      ~ bucket = "snakemake-output" # forces replacement -> (known after apply)
      ~ id     = "snakemake-output,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "koshima789" -> null
                  - id           = "c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          - owner {
              - display_name = "koshima789" -> null
              - id           = "c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2" -> null
            }
        }
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "snakemake-output" # forces replacement -> (known after apply)
      ~ id                      = "snakemake-output" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket = "snakemake-output" # forces replacement -> (known after apply)
      ~ id     = "snakemake-output" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket = "snakemake-output" # forces replacement -> (known after apply)
      ~ id     = "snakemake-output" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 36 to add, 0 to change, 35 to destroy.

```

</details>

*Pushed by: @koisland, Action: `pull_request`*